cases/openfoam.com/dakotaGeometricVariation/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 350;

boundaryField
{
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet 
    {
        type            zeroGradient;
    }
    inletHot
    {
        type            fixedValue;
        value           uniform 350;
    }

    inletCold
    {
        type            fixedValue;
        value           uniform 280;
    }

    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
